## Plan Result (aat_global)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 123 to add, 0 to change, 123 to destroy.</code></pre>

* Create
  * module.landing_zone[0].azurerm_frontdoor.main
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;adoption&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;adoption-web&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;bar&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;cft-api-mgmt&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;civil-citizen-ui&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;cmc&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;cmc-legal&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;cui-ra&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;div-da&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;div-dn&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;div-pfe&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;div-rfe&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;ds-ui&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;dss-update-case&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;em-icp&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;et-pet-admin&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;et-pet-et1&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;et-pet-et3&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;et-sya&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;fact&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;fact-admin&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;fees-register&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;fis-ds-web&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;gateway-ccd&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;help-with-fees-publicapp&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;help-with-fees-staffapp&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;hmcts-access&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;hmi-apim&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;ia-aip&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;idam-user-dashboard&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;idam-web-admin&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;idam-web-public&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;judicial-payments&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;lau&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;nfdiv&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;nfdiv-apply&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;nfdiv-civil&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;paybubble&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;paymentoutcome-web&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;pcq&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;pet-app1&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;pet-app2&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;plum&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;privatelaw&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;probate&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;reformscan&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;reformscanstg&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;return-case-doc-ccd&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;rpts&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;sptribs-frontend&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;sscs-cor&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;sscs-tribunals&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;sscs-tya&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;tax-tribunals-datacapture&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;wa-proto-frontend&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;xui-approve-org&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;xui-manage-org&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;xui-register-org&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https[&#34;xui-webapp&#34;]
  * module.landing_zone[0].azurerm_frontdoor_custom_https_configuration.https_www_redirect[&#34;paymentoutcome-web&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;adoption&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;adoption-web&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;bar&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;cft-api-mgmt&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;civil-citizen-ui&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;cmc&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;cmc-legal&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;cui-ra&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;div-da&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;div-dn&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;div-pfe&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;div-rfe&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;ds-ui&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;dss-update-case&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;em-icp&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;et-pet-admin&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;et-pet-et1&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;et-pet-et3&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;et-sya&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;fact&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;fact-admin&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;fees-register&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;fis-ds-web&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;gateway-ccd&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;help-with-fees-publicapp&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;help-with-fees-staffapp&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;hmcts-access&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;hmi-apim&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;ia-aip&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;idam-user-dashboard&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;idam-web-admin&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;idam-web-public&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;judicial-payments&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;lau&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;nfdiv&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;nfdiv-apply&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;nfdiv-civil&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;paybubble&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;paymentoutcome-web&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;pcq&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;pet-app1&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;pet-app2&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;plum&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;privatelaw&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;probate&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;reformscan&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;reformscanstg&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;return-case-doc-ccd&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;rpts&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;sptribs-frontend&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;sscs-cor&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;sscs-tribunals&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;sscs-tya&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;tax-tribunals-datacapture&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;wa-proto-frontend&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;xui-approve-org&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;xui-manage-org&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;xui-register-org&#34;]
  * module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom[&#34;xui-webapp&#34;]
  * module.landing_zone[0].azurerm_key_vault_access_policy.frontdoor_kv_access[0]
  * module.landing_zone[0].azurerm_monitor_diagnostic_setting.frontdoor_diagnostics
  * module.landing_zone[0].azurerm_role_assignment.frontdoor_kv_access[0]
* Delete
  * module.landing_zone.azurerm_frontdoor.main
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;adoption&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;adoption-web&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;bar&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;cft-api-mgmt&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;civil-citizen-ui&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;cmc&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;cmc-legal&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;cui-ra&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;div-da&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;div-dn&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;div-pfe&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;div-rfe&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;ds-ui&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;dss-update-case&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;em-icp&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;et-pet-admin&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;et-pet-et1&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;et-pet-et3&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;et-sya&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;fact&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;fact-admin&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;fees-register&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;fis-ds-web&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;gateway-ccd&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;help-with-fees-publicapp&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;help-with-fees-staffapp&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;hmcts-access&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;hmi-apim&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;ia-aip&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;idam-user-dashboard&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;idam-web-admin&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;idam-web-public&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;judicial-payments&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;lau&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;nfdiv&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;nfdiv-apply&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;nfdiv-civil&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;paybubble&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;paymentoutcome-web&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;pcq&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;pet-app1&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;pet-app2&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;plum&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;privatelaw&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;probate&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;reformscan&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;reformscanstg&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;return-case-doc-ccd&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;rpts&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;sptribs-frontend&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;sscs-cor&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;sscs-tribunals&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;sscs-tya&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;tax-tribunals-datacapture&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;wa-proto-frontend&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;xui-approve-org&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;xui-manage-org&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;xui-register-org&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;xui-webapp&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https_www_redirect[&#34;paymentoutcome-web&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;adoption&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;adoption-web&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;bar&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;cft-api-mgmt&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;civil-citizen-ui&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;cmc&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;cmc-legal&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;cui-ra&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;div-da&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;div-dn&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;div-pfe&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;div-rfe&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;ds-ui&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;dss-update-case&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;em-icp&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;et-pet-admin&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;et-pet-et1&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;et-pet-et3&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;et-sya&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;fact&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;fact-admin&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;fees-register&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;fis-ds-web&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;gateway-ccd&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;help-with-fees-publicapp&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;help-with-fees-staffapp&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;hmcts-access&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;hmi-apim&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;ia-aip&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;idam-user-dashboard&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;idam-web-admin&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;idam-web-public&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;judicial-payments&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;lau&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;nfdiv&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;nfdiv-apply&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;nfdiv-civil&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;paybubble&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;paymentoutcome-web&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;pcq&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;pet-app1&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;pet-app2&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;plum&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;privatelaw&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;probate&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;reformscan&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;reformscanstg&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;return-case-doc-ccd&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;rpts&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;sptribs-frontend&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;sscs-cor&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;sscs-tribunals&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;sscs-tya&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;tax-tribunals-datacapture&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;wa-proto-frontend&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;xui-approve-org&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;xui-manage-org&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;xui-register-org&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;xui-webapp&#34;]
  * module.landing_zone.azurerm_key_vault_access_policy.frontdoor_kv_access[0]
  * module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics
  * module.landing_zone.azurerm_role_assignment.frontdoor_kv_access[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone.azurerm_frontdoor.main will be destroyed
  # (because module.landing_zone is not in configuration)
  - resource "azurerm_frontdoor" "main" {
      - backend_pool_health_probes           = {
          - "defaultHealthProbe"                            = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/defaultHealthProbe"
          - "healthProbeSettings-adoption"                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-adoption"
          - "healthProbeSettings-adoption-web"              = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-adoption-web"
          - "healthProbeSettings-bar"                       = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-bar"
          - "healthProbeSettings-cft-api-mgmt"              = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-cft-api-mgmt"
          - "healthProbeSettings-civil-citizen-ui"          = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-civil-citizen-ui"
          - "healthProbeSettings-cmc"                       = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-cmc"
          - "healthProbeSettings-cmc-legal"                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-cmc-legal"
          - "healthProbeSettings-cui-ra"                    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-cui-ra"
          - "healthProbeSettings-div-da"                    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-div-da"
          - "healthProbeSettings-div-dn"                    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-div-dn"
          - "healthProbeSettings-div-pfe"                   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-div-pfe"
          - "healthProbeSettings-div-rfe"                   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-div-rfe"
          - "healthProbeSettings-ds-ui"                     = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-ds-ui"
          - "healthProbeSettings-dss-update-case"           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-dss-update-case"
          - "healthProbeSettings-em-icp"                    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-em-icp"
          - "healthProbeSettings-et-pet-admin"              = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-et-pet-admin"
          - "healthProbeSettings-et-pet-et1"                = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-et-pet-et1"
          - "healthProbeSettings-et-pet-et3"                = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-et-pet-et3"
          - "healthProbeSettings-et-sya"                    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-et-sya"
          - "healthProbeSettings-fact"                      = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-fact"
          - "healthProbeSettings-fact-admin"                = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-fact-admin"
          - "healthProbeSettings-fees-register"             = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-fees-register"
          - "healthProbeSettings-fis-ds-web"                = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-fis-ds-web"
          - "healthProbeSettings-gateway-ccd"               = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-gateway-ccd"
          - "healthProbeSettings-help-with-fees-publicapp"  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-help-with-fees-publicapp"
          - "healthProbeSettings-help-with-fees-staffapp"   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-help-with-fees-staffapp"
          - "healthProbeSettings-hmcts-access"              = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-hmcts-access"
          - "healthProbeSettings-hmi-apim"                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-hmi-apim"
          - "healthProbeSettings-ia-aip"                    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-ia-aip"
          - "healthProbeSettings-idam-user-dashboard"       = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-idam-user-dashboard"
          - "healthProbeSettings-idam-web-admin"            = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-idam-web-admin"
          - "healthProbeSettings-idam-web-public"           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-idam-web-public"
          - "healthProbeSettings-judicial-payments"         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-judicial-payments"
          - "healthProbeSettings-lau"                       = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-lau"
          - "healthProbeSettings-nfdiv"                     = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-nfdiv"
          - "healthProbeSettings-paybubble"                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-paybubble"
          - "healthProbeSettings-paymentoutcome-web"        = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-paymentoutcome-web"
          - "healthProbeSettings-pcq"                       = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-pcq"
          - "healthProbeSettings-pet-app1"                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-pet-app1"
          - "healthProbeSettings-pet-app2"                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-pet-app2"
          - "healthProbeSettings-plum"                      = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-plum"
          - "healthProbeSettings-privatelaw"                = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-privatelaw"
          - "healthProbeSettings-probate"                   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-probate"
          - "healthProbeSettings-reformscan"                = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-reformscan"
          - "healthProbeSettings-reformscanstg"             = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-reformscanstg"
          - "healthProbeSettings-return-case-doc-ccd"       = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-return-case-doc-ccd"
          - "healthProbeSettings-rpts"                      = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-rpts"
          - "healthProbeSettings-sptribs-frontend"          = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-sptribs-frontend"
          - "healthProbeSettings-sscs-cor"                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-sscs-cor"
          - "healthProbeSettings-sscs-tribunals"            = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-sscs-tribunals"
          - "healthProbeSettings-sscs-tya"                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-sscs-tya"
          - "healthProbeSettings-tax-tribunals-datacapture" = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-tax-tribunals-datacapture"
          - "healthProbeSettings-wa-proto-frontend"         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-wa-proto-frontend"
          - "healthProbeSettings-xui-approve-org"           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-xui-approve-org"
          - "healthProbeSettings-xui-manage-org"            = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-xui-manage-org"
          - "healthProbeSettings-xui-register-org"          = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-xui-register-org"
          - "healthProbeSettings-xui-webapp"                = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/healthProbeSettings/healthProbeSettings-xui-webapp"
        } -> null
      - backend_pool_load_balancing_settings = {
          - "defaultLoadBalancing"                            = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/loadBalancingSettings/defaultLoadBalancing"
          - "loadBalancingSettings-adoption"                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/loadBalancingSettings/loadBalancingSettings-adoption"
          - "loadBalancingSettings-adoption-web"              = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/loadBalancingSettings/loadBalancingSettings-adoption-web"
          - "loadBalancingSettings-bar"                       = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/loadBalancingSettings/loadBalancingSettings-bar"
          - "loadBalancingSettings-cft-api-mgmt"              = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/loadBalancingSettings/loadBalancingSettings-cft-api-mgmt"
          - "loadBalancingSettings-civil-citizen-ui"          = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/loadBalancingSettings/loadBalancingSettings-civil-citizen-ui"
          - "loadBalancingSettings-cmc"                       = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/loadBalancingSettings/loadBalancingSettings-cmc"
          - "loadBalancingSettings-cmc-legal"                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/loadBalancingSettings/loadBalancingSettings-cmc-legal"
          - "loadBalancingSettings-cui-ra"                    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/loadBalancingSettings/loadBalancingSettings-cui-ra"
          - "loadBalancingSettings-div-da"                    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/loadBalancingSettings/loadBalancingSettings-div-da"
          - "loadBalancingSettings-div-dn"                    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/loadBalancingSettings/loadBalancingSettings-div-dn"
          - "loadBalancingSettings-div-pfe"                   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/loadBalancingSettings/loadBalancingSettings-div-pfe"
          - "loadBalancingSettings-div-rfe"                   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/loadBalancingSettings/loadBalancingSettings-div-rfe"
          - "loadBalancingSettings-ds-ui"                     = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/loadBalancingSettings/loadBalancingSettings-ds-ui"
          - "loadBalancingSettings-dss-update-case"           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/loadBalancingSettings/loadBalancingSettings-dss-update-case"
          - "loadBalancingSettings-em-icp"                    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/loadBalancingSettings/loadBalancingSettings-em-icp"
          - "loadBalancingSettings-et-pet-admin"              = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/loadBalancingSettings/loadBalancingSettings-et-pet-admin"
          - "loadBalancingSettings-et-pet-et1"                = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/loadBalancingSettings/loadBalancingSettings-et-pet-et1"
          - "loadBalancingSettings-et-pet-et3"                = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/loadBalancingSettings/loadBalancingSettings-et-pet-et3"
          - "loadBalancingSettings-et-sya"                    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/loadBalancingSettings/loadBalancingSettings-et-sya"
          - "loadBalancingSettings-fact"                      = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/loadBalancingSettings/loadBalancingSettings-fact"
          - "loadBalancingSettings-fact-admin"                = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/loadBalancingSettings/loadBalancingSettings-fact-admin"
          - "loadBalancingSettings-fees-register"             = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/lz-aat-rg/providers/Microsoft.Network/frontDoors/hmcts-aat/loadBalancingSettings/loadBalancingSettings-fees-register"
          - "loadBalancingSettings-fis-ds-web"                = "/subscription

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

rontdoor_firewall_policy.custom["sscs-cor"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "sscscoraat"
      + resource_group_name   = "lz-aat-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "connect.sid"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "iss"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "code"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "_csrf"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "_csrf"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "question-field"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "describeTheEvidence"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_ga"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_gid"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_gat"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "dtCookie"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "dtLatC"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "dtPC"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "dtSa"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "rxVisitor"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "rxvt"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "cookies_policy"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "rf"
            }
        }
    }

  # module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["sscs-tribunals"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "sscstribunalsaat"
      + resource_group_name   = "lz-aat-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "session"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "__auth-token"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "__state"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "iss"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "code"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "reasonForNoMRN"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "reasonForBeingLate"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "nino"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "signer"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "selection.signLanguage.language"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "selection.anythingElse.language"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_ga"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_gid"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_gat"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "dtCookie"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "dtLatC"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "dtPC"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "dtSa"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "rxVisitor"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "rxvt"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "cookies_policy"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "rf"
            }
        }
    }

  # module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["sscs-tya"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "sscstyaaat"
      + resource_group_name   = "lz-aat-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["tax-tribunals-datacapture"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "taxtribunalsdatacaptureaat"
      + resource_group_name   = "lz-aat-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_tax-tribunals-datacapture_session"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "cookie_setting"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_utma"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_utmb"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_utmc"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_utmz"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_ga"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "authenticity_token"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "address_lookup_url"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "steps_closure_support_documents_form[having_problems_uploading][]"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "StartsWith"
              + selector       = "steps_closure_support_documents_form"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "StartsWith"
              + selector       = "steps_details_documents_upload_form"
            }
        }
    }

  # module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["wa-proto-frontend"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "waprotofrontendaat"
      + resource_group_name   = "lz-aat-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["xui-approve-org"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "xuiapproveorgaat"
      + resource_group_name   = "lz-aat-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["xui-manage-org"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "xuimanageorgaat"
      + resource_group_name   = "lz-aat-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["xui-register-org"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "xuiregisterorgaat"
      + resource_group_name   = "lz-aat-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.landing_zone[0].azurerm_frontdoor_firewall_policy.custom["xui-webapp"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "xuiwebappaat"
      + resource_group_name   = "lz-aat-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.landing_zone[0].azurerm_key_vault_access_policy.frontdoor_kv_access[0] will be created
  + resource "azurerm_key_vault_access_policy" "frontdoor_kv_access" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-platform-stg-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsstg"
      + object_id               = "0a7e9367-4349-4b24-974a-bfa7b23a38fc"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.landing_zone[0].azurerm_monitor_diagnostic_setting.frontdoor_diagnostics will be created
  + resource "azurerm_monitor_diagnostic_setting" "frontdoor_diagnostics" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
      + name                           = "fd-log-analytics"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "FrontdoorAccessLog"

          + retention_policy {
              + days    = 7
              + enabled = true
            }
        }
      + enabled_log {
          + category = "FrontdoorWebApplicationFirewallLog"

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
    }

  # module.landing_zone[0].azurerm_role_assignment.frontdoor_kv_access[0] will be created
  + resource "azurerm_role_assignment" "frontdoor_kv_access" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0a7e9367-4349-4b24-974a-bfa7b23a38fc"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-platform-stg-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsstg"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 123 to add, 0 to change, 123 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1776,"Program":"tfcmt","SHA1":"","Target":"aat_global","Vars":{}} -->